In [7]:
import pandas as pd
import numpy as np

In [8]:
sales = [{'account': 'Alil', 'Jan': 150, 'Feb': 200},
         {'account': 'Alil',  'Jan': 150, 'Feb': 200},
         {'account': 'Alil',  'Jan': 100,  'Feb': 100},
         {'account': 'Yana',  'Jan': 50,  'Feb': 90},
         {'account': 'Yana','Jan': 50,  'Feb': 90},
         {'account': 'Zhafran', 'Jan': 60,  'Feb': 40}]
df = pd.DataFrame(sales)
df

   account  Jan  Feb
0     Alil  150  200
1     Alil  150  200
2     Alil  100  100
3     Yana   50   90
4     Yana   50   90
5  Zhafran   60   40

In [9]:
df.groupby('account').count()

         Jan  Feb
account
Alil       3    3
Yana       2    2
Zhafran    1    1

In [12]:
diff = pd.DataFrame({'Alil': ['a', 'c', 'd'], 
                     'Yana': ['d', 'a', 'c'],
                     'Zhafran': [1, 2, 3]})
diff

  Alil Yana  Zhafran
0    a    d        1
1    c    a        2
2    d    c        3

In [14]:
one_hot = pd.get_dummies(diff, prefix=['', ''])
one_hot

   Zhafran  _a  _c  _d  _a  _c  _d
0        1   1   0   0   0   0   1
1        2   0   1   0   1   0   0
2        3   0   0   1   0   1   0

In [30]:
a = ['a', 'b', 'c']
b= ['d', 'e', 'f']
c = a + b
c

['a', 'b', 'c', 'd', 'e', 'f']

In [48]:
a = [diff.columns[-1]]
a

['Zhafran']

In [49]:
b = ['Bagin', 'Ekal']
b

['Bagin', 'Ekal']

In [50]:
c = a + b
c

['Zhafran', 'Bagin', 'Ekal']

In [53]:
d = diff.T.reset_index
d

<bound method DataFrame.reset_index of          0  1  2
Alil     a  c  d
Yana     d  a  c
Zhafran  1  2  3>

In [55]:
np.arange(10)

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])